# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'gwerbin/tap'

# Install Binaries
brew 'bash' # Bash 4
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'
brew 'z'
brew 'fzf'
brew 'ctags'
brew 'thefuck'
brew 'mycli'
brew 'nvm'
brew 'wget'
brew 'the_silver_searcher'
brew 'httpie'

# Development
brew 'php@7.2'
brew 'mysql@5.7'
brew 'node'
cask 'gwerbin/tap/sqlcheck'

# Apps
cask 'alfred2'
cask 'google-chrome'
cask 'grammarly'
cask 'sequel-pro'
cask 'mysqlworkbench'
cask 'db-browser-for-sqlite'
cask 'slack'
cask 'skype'
cask 'whatsapp'
cask 'discord'
cask 'iterm2'
cask 'ngrok'
cask 'anaconda'
cask 'spotify'
cask 'spectacle'
cask 'karabiner-elements'
cask 'skitch'
cask 'licecap'
cask 'postman'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
