# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Install Binaries
brew 'bash' # Bash 4
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'
brew 'z'
brew 'fzf'
brew 'ctags'
brew 'thefuck'
brew 'mycli'

# Development
brew 'php'
brew 'mysql'
brew 'node'
brew 'python3'
brew 'pipenv'

# Apps
cask 'alfred2'
cask 'google-chrome'
cask 'grammarly'
cask 'sequel-pro'
cask 'slack'
cask 'iterm2'
cask 'ngrok'
cask 'anaconda'
cask 'spotify'
cask 'spectacle'
cask 'karabiner-elements'
cask 'skitch'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
