tap 'homebrew/cask'

brew 'git'
brew 'zsh'
brew 'z'
brew 'wget'
brew 'fzf'
brew 'the_silver_searcher'
brew 'tree'
brew 'php'
brew 'php@7.4'
brew 'brew-php-switcher'
brew 'mysql'
brew 'composer'
brew 'redis'
brew 'node'
brew 'yarn'
brew 'vim'

brew 'neovim', args: ['HEAD']
cask 'keycastr'
cask 'github'
cask 'grammarly'
cask 'iterm2'
cask 'spotify'
cask 'spectacle'
cask 'slack'
cask 'zoom'
cask 'discord'
cask 'firefox'
cask 'google-chrome'
cask 'anydesk'
cask 'obs'
cask 'skitch'
cask 'visual-studio-code'
cask 'phpstorm'
cask 'notion'
cask 'karabiner-elements'
cask 'appcleaner'
cask 'docker'
